use bitflags::*;

///
/// 页表项，用来查找物理内存地址的内容，它存在于页表页（记录页表索引内容的页表）中，结构如下：
///
/// ```
/// |63      54|53    28|27    19|18    10|9   8|7|6|5|4|3|2|1|0|
/// | Reserved | PPN[2] | PPN[1] | PPN[0] | RSW |D|A|G|U|X|W|R|V|
/// |    10    |   26   |    9   |    9   |  2  |1|1|1|1|1|1|1|1|
/// ```
///
/// 使用流程：
///
/// 1. 39位虚拟地址分隔：
///
/// ```
/// |    9   |    9   |    9   |   12   |
/// | VPN[2] | VPN[1] | VPN[0] | offset |
///
/// // 注：虽然 VPN 直译为虚拟页码，但是它本质上是物理页的索引
/// ```
///
/// 2. 根据 VPN 查找3级内存分页，流程如下
///
/// ```
/// 1.假设虚拟地址为：
///     VA = 0x012345678
///
/// 2.计算虚拟页码和偏移：
///     VPN[2] = (VA >> 30) & 0x1FF = 0
///     VPN[1] = (VA >> 21) & 0x1FF = 0x91
///     VPN[0] = (VA >> 12) & 0x1FF = 0x145
///     offset = 0x678
///
/// 3.虚拟地址的基地址为：
///     L2_base = 0x1000_0000
///
/// 4.获取一级页表的物理地址，通过该地址获取二级页表项的物理内存地址
///     计算过程：
///         1.先通过 MMU 获取 虚拟地址 0x1000_0000 对应的物理页码 0x2001
///         2.上面我们说过虚拟页码其实是物理页的索引，因此二级页表的页表项地址为：PA[0] = 0x2001 + (0x00 * 8) = 0x2001
///             注：这里的 8 是指 8字节，内存寻址按一个字节为单位，因此 8字节 刚好就是一个页表项的长度 64位
///
///     L2_index = 0 → L2_PTE_addr = 0x1000_0000 → PPN=0x2001
///
/// 5.读取二级页表项内容，计算三级页表项物理内存地址，计算过程如上：
///     计算过程：PA[1] = 0x2001 << 12 + (0x91 * 8) = 0x2001_0488
///
///     L1_base = 0x2001_0000
///     L1_index = 0x24 → L1_PTE_addr = 0x2001_0488 → PPN=0x3002
///
/// 6.读取三级页表项内容，计算需要获取的数据所在的物理内存地址，计算过程如上：
///     计算过程：PA[2] = 0x3002 << 12 + (0x145 * 8) = 0x3002_0A28
///
///     L0_base = 0x3002_0000
///     L0_index = 0x145 → L0_PTE_addr = 0x3002_0A28 → PPN=0x4003
///
/// 7.计算数据所在的物理地址
///     计算过程：PA = 0x4003 << 12 + 0x678（偏移值） = 0x4003_0678
///
/// PA = 0x4003_0000 + 0x678 = 0x4003_0678
/// ```
///

bitflags! {
    pub struct PTEFlags: u8 {
        const V = 1 << 0;
        const R = 1 << 1;
        const W = 1 << 2;
        const X = 1 << 3;
        const U = 1 << 4;
        const G = 1 << 5;
        const A = 1 << 6;
        const D = 1 << 7;
    }
}
